In [2]:
import pandas as pd

In [3]:
df1= pd.DataFrame({'x': [1,2,3,4,5], 'y': [9,8,7,6,5]})
df2= pd.DataFrame ([{'x':1, 'y':9}, {'x':2, 'y':8}, {'x':3, 'y':7,}, {'x':4, 'y':6},{'x':2, 'y':8}])

In [4]:
df2

   x  y
0  1  9
1  2  8
2  3  7
3  4  6
4  2  8

In [5]:
len(df1.index)

5

In [6]:
df1.columns

Index(['x', 'y'], dtype='object')

In [7]:
df1.head(2)

   x  y
0  1  9
1  2  8

In [8]:
df1.tail(3)

   x  y
2  3  7
3  4  6
4  5  5

In [9]:
df1['x']

0    1
1    2
2    3
3    4
4    5
Name: x, dtype: int64

In [10]:
df1['x'].loc[0]
# loc calls the specific name you call

1

In [11]:
df1['x'].iloc[0]
# iloc is the index you call

1

In [12]:
#Use this one
df1[df1['x']>2] ['x']

2    3
3    4
4    5
Name: x, dtype: int64

In [13]:
#Not this one
df1['x'][df1['x']>2]

2    3
3    4
4    5
Name: x, dtype: int64

In [14]:
df1.to_csv('example_data.csv')

In [15]:
df3=df1

In [16]:
df3['y']= [34,45,56,67,23]

In [17]:
df3['z']= df3['y']+3
df3

   x   y   z
0  1  34  37
1  2  45  48
2  3  56  59
3  4  67  70
4  5  23  26

In [18]:
df3.isnull()

       x      y      z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [19]:
df3.iloc[1]

x     2
y    45
z    48
Name: 1, dtype: int64

In [20]:
df3['k']=[x/2 for x in df3 ['x']]

In [21]:
df3

   x   y   z    k
0  1  34  37  0.5
1  2  45  48  1.0
2  3  56  59  1.5
3  4  67  70  2.0
4  5  23  26  2.5

In [22]:
k= []
for i in df3.index:
    k[i]=df3['x'][i]/2

IndexError: list assignment index out of range

In [23]:
for i in df3['y']:
    print(i)

34
45
56
67
23

In [24]:
df3.to_csv('pandachallange.csv')

Why are dynamic, interactive data visualizations useful when communicating data?
People can be given the ability to independently examine the data through dynamic, interactive visuals.Also it encourages users to find new links and patterns while exploring data.